trade_exp/src/DataProcessors/ОтчетВыписка/ОтчетВыписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтчетВыписка</name>
</mdclass:DataProcessor>

trade_exp/src/Enums/СтатусыКартЛояльности/СтатусыКартЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыКартЛояльности</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f1baa0f1-c6c0-430d-90f6-7d9027b50b0a">
    <name>Аннулирована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b6d3dd02-b8c3-47f2-a86f-e222d2841283">
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/КартыЛояльности/КартыЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КартыЛояльности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.ВидыКартЛояльности</owners>
  <attributes>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МагнитныйКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ОтчетВыписка/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет=ОбработкаОбъект.ПолучитьМакетОтчета();

	ЗаполнитьТаблицуЗапросов(ОбработкаОбъект);
	
	ОбновитьТекстЗапроса();
	
	ОбновитьТаблицуДокументовНаСервере();
	
	ВывестиТабличныйДокумент(Макет);
	
КонецПроцедуры

Процедура ВывестиТабличныйДокумент(Макет)

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	если значениезаполнено(Организация) тогда
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ТекущаяДата() );
		ОбластьЗаголовок.Параметры.Организация=СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
		ОбластьЗаголовок.Параметры.ИННОрганизации="ИНН "+СведенияОбОрганизации.ИНН;
	конецесли;
	ОбластьЗаголовок.Параметры.ДатаВыдачи=текущаяДата();
	ОбластьЗаголовок.Параметры.ПартнерИмя=Параметр.НаименованиеПолное;
	если значениезаполнено(ПериодВыборкиДокументов) тогда
	ОбластьЗаголовок.Параметры.Период=ПредставлениеПериода(ПериодВыборкиДокументов.ДатаНачала, ПериодВыборкиДокументов.ДатаОкончания, "ФП = Истина");	
	конецесли;	
		
	ОбластьЗаголовок.Параметры.НомерКарты=ВернутьНомерКарты(Параметр);
	
	ТаблицаОтчета.Очистить();
	ТаблицаОтчета.Вывести(ОбластьЗаголовок);
	
	ТаблицаОтчета.Вывести(ОбластьШапкаТаблицы);
	ТаблицаОтчета.НачатьАвтогруппировкуСтрок();
	
	НомерПП=0;
	для каждого стр из ТаблицаДокументов Цикл
		если стр.суммаДокумента<=1 тогда
			продолжить;
		конецесли;	
		Номерпп=НомерПП+1;
		ОбластьДетальныхЗаписей.Параметры.Заполнить(стр);
		ОбластьДетальныхЗаписей.Параметры.НомерПП=НомерПП;
		ТаблицаОтчета.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	ТаблицаОтчета.ПолеСлева=6;
	ТаблицаОтчета.ПолеСправа=6;
		
	ТаблицаОтчета.ЗакончитьАвтогруппировкуСтрок();
	ТаблицаОтчета.АвтоМасштаб = Истина;
	ТаблицаОтчета.Вывести(ОбластьПодвалТаблицы);
	ТаблицаОтчета.Вывести(ОбластьПодвал);

КонецПроцедуры

Функция ВернутьНомерКарты(Партнер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КартыЛояльности.Штрихкод КАК Штрихкод,
		|	КартыЛояльности.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Партнер = &Партнер
		|	И КартыЛояльности.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКартЛояльности.действует)";
	
	Запрос.УстановитьПараметр("Партнер",Партнер);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		
		возврат ВыборкаДетальныеЗаписи.Штрихкод;
	иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуЗапросов(ОбработкаОбъект)

	ДополнительныеДокументы = Новый Массив;

	ПоляШапки = Новый Массив;
	ПоляШапки.Добавить("СуммаДокумента");
	ПоляШапки.Добавить("Валюта");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("Организация");

	ТаблицаЗапросов.Очистить();
	
	Обработки.ОтчетВыписка.ЗаполнитьТаблицуЗапросов(ТаблицаЗапросов, "ДокументыПоПартнеру",
			ДополнительныеДокументы,
			ПоляШапки);
			
			
	// дополняем запросы
	для каждого стр из Таблицазапросов цикл
		если Метаданные.Документы[стр.ИмяДокумента].Реквизиты.Найти("Организация")<>Неопределено тогда
		стр.ТекстЗапросаВыборка=стр.ТекстЗапросаВыборка+"
		|
		 | ГДЕ
		 | Выбор когда &ОтборПоОрганизации тогда ТаблицаШапки.Организация=&Организация иначе истина конец
		 |";
	конецесли;
	если стр.ИмяДокумента="ЧекККМ" или
		стр.ИмяДокумента="ЧекККМВозврат" тогда
		стр.ТекстЗапросаВыборка=стр.ТекстЗапросаВыборка+"
		 | и ТаблицаШапки.Статус=значение(Перечисление.СтатусыЧековККМ.Пробит)
		 |";
    конецесли;
		если стр.ИмяДокумента="ВозвратТоваровОтКлиента" или
			стр.ИмяДокумента="КорректировкаРеализации" или
			стр.ИмяДокумента="ОперацияПоПлатежнойКарте" или
			стр.ИмяДокумента="ПоступлениеБезналичныхДенежныхСредств" или
			стр.ИмяДокумента="ПриходныйКассовыйОрдер" или
			стр.ИмяДокумента="РасходныйКассовыйОрдер" или
			стр.ИмяДокумента="РеализацияТоваровУслуг" или
			стр.ИмяДокумента="РеализацияУслугПрочихАктивов" или
			стр.ИмяДокумента="СписаниеБезналичныхДенежныхСредств" или
			стр.ИмяДокумента="ЧекККМ" или
			стр.ИмяДокумента="ЧекККМВозврат" тогда
			стр.использовать=истина;
		иначе
			стр.использовать=ложь;
		конецесли;
	конеццикла;	

КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстЗапроса()

	ВремТекстЗапросаВт     = "";
	ВремТекстЗапросаДанные = "";
	Для Каждого СтрокаТаб Из ТаблицаЗапросов.НайтиСтроки(Новый Структура("Использовать", Истина)) Цикл

		ВремТекстЗапросаВт = ВремТекстЗапросаВт + ?(ПустаяСтрока(ВремТекстЗапросаВт), "", " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС)
				+ СтрокаТаб.ТекстЗапроса;

		ВремТекстЗапросаДанные = ВремТекстЗапросаДанные + ?(ПустаяСтрока(ВремТекстЗапросаДанные), "", " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС)
				+ СтрокаТаб.ТекстЗапросаВыборка;

	КонецЦикла;

	Позиция = СтрНайти(ВРЕГ(ВремТекстЗапросаВт), ВРег("//%ПОМЕСТИТЬ%"));
	Если Позиция > 0 Тогда

		ВремТекстЗапросаВт = ЛЕВ(ВремТекстЗапросаВт, Позиция-1) + Сред(ВремТекстЗапросаВт, Позиция + СтрДлина("//%ПОМЕСТИТЬ%"));

	КонецЕсли;

	Позиция = СтрНайти(ВРЕГ(ВремТекстЗапросаДанные), ВРег("Выбрать"));
	Если Позиция > 0 Тогда

		ВремТекстЗапросаДанные = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + Сред(ВремТекстЗапросаДанные, Позиция + СтрДлина("Выбрать")) + 
		"УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Документ
		|";

	КонецЕсли;

	ТекстЗапросаФильтр       = ВремТекстЗапросаВт;
	ТекстЗапросаПоДокументам = ВремТекстЗапросаДанные;

КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуДокументовНаСервере()

	Если не значениезаполнено(Организация) Тогда

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать организацию '"),,"ЭтаФорма");
		Возврат;

	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапросаФильтр);
	Запрос.УстановитьПараметр("Параметр",         Параметр);
	Запрос.УстановитьПараметр("НачалоПериода",    ПериодВыборкиДокументов.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ПериодВыборкиДокументов.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтборПоОрганизации", ?(значениезаполнено(Организация),истина,ложь));
	

	Запрос.МенеджерВременныхТаблиц  = Новый МенеджерВременныхТаблиц;

	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Запрос.Текст = ТекстЗапросаПоДокументам;
	
	ТаблицаДокументов.Очистить();
	
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ТаблицаДокументов");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	УстановитьКлючНастроек();
	
	ЗаполнитьТаблицуЗапросов(ОбработкаОбъект);
	
	ВосстановитьНастройки();
	
	ОбновитьТекстЗапроса();

	УстановитьЗначенияПоУмолчанию();

	ПрименитьПараметрыКоманды();
	
	Макет=ОбработкаОбъект.ПолучитьМакетОтчета();

	ВывестиТабличныйДокумент(Макет);
	
КонецПроцедуры

#Область Настройки

&НаСервере
Процедура ВосстановитьНастройки()

	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.ОтчетВыписка", КлючНастроек);
	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда

		ПериодВыборкиДокументов.ДатаНачала    = ЗначениеНастроек.Получить("ДатаНачала");
		ПериодВыборкиДокументов.ДатаОкончания = ЗначениеНастроек.Получить("ДатаОкончания");

		Партнер = ЗначениеНастроек.Получить("Параметр");

		Организация=ЗначениеНастроек.Получить("Организация");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()

	Настройки = Новый Соответствие;
	Настройки.Вставить("Партнер",               Параметр);
	Настройки.Вставить("Организация",               Организация);
	Настройки.Вставить("ДатаНачала",            ПериодВыборкиДокументов.ДатаНачала);
	Настройки.Вставить("ДатаОкончания",         ПериодВыборкиДокументов.ДатаОкончания);

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ОтчетВыписка", КлючНастроек, Настройки);

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(ПериодВыборкиДокументов.ДатаНачала)
		Или Не ЗначениеЗаполнено(ПериодВыборкиДокументов.ДатаОкончания) Тогда
		
		ПериодВыборкиДокументов.ДатаНачала    = ДобавитьМесяц(ТекущаяДатаСеанса(), - 12);
		ПериодВыборкиДокументов.ДатаОкончания = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьПараметрыКоманды()

	Если Параметры.Свойство("Отбор") Тогда

		Параметры.Отбор.Свойство("Партнер", Параметр);
	
	КонецЕсли;

	Если Параметры.Свойство("СформироватьПриОткрытии") И Параметры.СформироватьПриОткрытии Тогда

		ОбновитьТаблицуДокументовНаСервере();

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Элементы.Параметр.Видимость = Истина;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
			Элементы.Параметр.Заголовок = НСтр("ru = 'Контрагент'");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьКлючНастроек()

	Если Параметры.Свойство("КлючНастроек") И Не ПустаяСтрока(Параметры.КлючНастроек) Тогда

		КлючНастроек = Параметры.КлючНастроек;

	Иначе

		КлючНастроек = "БезПартнера";

	КонецЕсли;

	КлючНастроек = КлючНастроек + "_" + Пользователи.ТекущийПользователь().УникальныйИдентификатор();

	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Партнер") Тогда

		КлючНастроек = КлючНастроек + "_" + Параметры.Отбор.Партнер.УникальныйИдентификатор();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройки();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
